ДомПласт_локальная_база/src/Enums/ОсобенностиУчетаНоменклатуры/ОсобенностиУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОсобенностиУчетаНоменклатуры</name>
  <enumValues>
    <name>БезОсобенностейУчета</name>
  </enumValues>
  <enumValues>
    <name>АлкогольнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияМаркируемаяДляГИСМ</name>
  </enumValues>
  <enumValues>
    <name>СодержитДрагоценныеМатериалы</name>
  </enumValues>
  <enumValues>
    <name>КиЗГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ТабачнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ОбувнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ЛекарственныеПрепараты</name>
  </enumValues>
</mdclass:Enum>

ДомПласт_локальная_база/src/Enums/ОсобенностиУчетаНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает текст подсказки по особенностям учета номенклатуры.
//
// Параметры:
//  ОсобенностьУчета - ПеречислениеСсылка.ОсобенностиУчетаНоменклатуры	 - особенность учета номенклатуры.
// 
// Возвращаемое значение:
//  Строка - подсказка по особенности учета номенклатуры.
//
Функция ПодсказкаПоОсобенностиУчетаНоменклатуры(ОсобенностьУчета) Экспорт
	
	Если ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета Тогда
		Возврат "";
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция Тогда
		Возврат НСтр("ru = 'Формируются декларации по алкогольной продукции и осуществляется обмен с ЕГАИС информацией по обороту.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.СодержитДрагоценныеМатериалы Тогда
		Возврат НСтр("ru = 'Статистическая отчетность по содержанию драгоценных материалов.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ПродукцияМаркируемаяДляГИСМ Тогда
		Возврат НСтр("ru = 'Продукция маркируется специальными контрольными идентификационными знаками (КиЗ) и осуществляется обмен с ГИСМ (информационной системой маркировки товаров) информацией по обороту.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.КиЗГИСМ Тогда
		Возврат НСтр("ru = 'Контрольные идентификационные знаки (КИЗ), которыми маркируется продукция, учитываемая в ГИСМ (информационной системе маркировки товаров).'");
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

//ИнтеграцияИСМПТК
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	//ДанныеВыбора.Добавить(Перечисления.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета);
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМПТК") Тогда
		
		//Если Константы.ВестиУчетМаркируемыхЛекарствИСМПТК.Получить() Тогда 
		//	ДанныеВыбора.Добавить(Перечисления.ОсобенностиУчетаНоменклатуры.ЛекарственныеПрепараты);
		//КонецЕсли;
		
		Если Константы.ВестиУчетМаркируемойОбувиИСМПТК.Получить() Тогда 
			ДанныеВыбора.Добавить(Перечисления.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция);
		КонецЕсли;
		
		Если Константы.ВестиУчетМаркируемогоТабакаИСМПТК.Получить() Тогда 
			ДанныеВыбора.Добавить(Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция);
		КонецЕсли;
		
		//Если Константы.ВестиУчетМаркируемойМолочкиИСМПТК.Получить() Тогда 
		//	ДанныеВыбора.Добавить(Перечисления.ОсобенностиУчетаНоменклатуры.МолочнаяПродукция);
		//КонецЕсли;
		//
		//Если Константы.ВестиУчетМаркируемогоТекстиляИСМПТК.Получить() Тогда 
		//	ДанныеВыбора.Добавить(Перечисления.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность);
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
//Конец ИнтеграцияИСМПТК

#КонецЕсли
